[
  {
    "title": "Housing targets should be ambitious but not arbitrary, says REIQ",
    "link": "https://channels.realty.com.au/housing-targets-should-be-ambitious-but-not-arbitrary/",
    "description": "The Real Estate Institute of Queensland (REIQ) is responding to revelations that Treasury has advised the Albanese Government that its flagship housing target of 1.2 million homes will not be met, describing the advice as disappointing but unsurprising. REIQ CEO Antonia Mercorella said the disclosure highlights the pressing need for a coordinated national housing strategy that moves beyond big numbers. “These targets are just numbers &#8230;\nThe post Housing targets should be ambitious but not arbitrary, says REIQ appeared first on Realty.com.au Blog - Everything about Real Estate.\n]]>",
    "pubDate": "Tue, 15 Jul 2025 02:04:29 +0000",
    "author": "",
    "category": ""
  },
  {
    "title": "Better returns but tenant care remains crucial",
    "link": "https://content.firstnational.com.au/blog/better-returns-but-tenant-care-remains-crucial/",
    "description": "Australia’s mid-year Cotality Housing Value Index offers welcome news for landlords: income streams are stabilising while capital values resume measured growth. National dwelling prices edged 0.6 per cent higher in June and 1.4 per cent for the quarter, leaving the median property at $837,586. Gross rental yields now hover near 3.7 per cent nationally, 3.5 per cent across the capitals...\nThe post Better returns but tenant care remains crucial appeared first on First National Real Estate.\n]]>",
    "pubDate": "Fri, 11 Jul 2025 05:11:33 +0000",
    "author": "",
    "category": ""
  },
  {
    "title": "Everyone wants to be a Queenslander – especially the Blues, says REIQ",
    "link": "https://channels.realty.com.au/everyone-wants-to-be-a-queenslander/",
    "description": "As State of Origin rivalry heats up ahead of the decider on 9 July, Queenslanders won’t be surprised to hear they’ve already scored a massive win – in the enviable lifestyle game. According to interstate migration data analysed by the Real Estate Institute of Queensland (REIQ), New South Wales residents are packing up and heading north in droves, confirming what locals have always known: Queensland &#8230;\nThe post Everyone wants to be a Queenslander – especially the Blues, says REIQ appeared first on Realty.com.au Blog - Everything about Real Estate.\n]]>",
    "pubDate": "Tue, 08 Jul 2025 03:17:36 +0000",
    "author": "",
    "category": ""
  }
]